-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Log/exercise3_2021020
> 3.log
  log type:  text
 opened on:   3 Feb 2021, 21:43:31

. 
. /*==============================================================================
> FILENAME: exercise3.do
> 
> PROJECT: Exercise 3, Stockholm Public Health Cohort     
> 
> PURPOSE: Demonstrate exercise3.do to the students
>         
> AUTHOR: Enoch Chen
> 
> CREATED: 20210203 Enoch Chen    
> UPDATED: 20210204 Enoch Chen            
> 
> INPUT DATA: sphc_all.dta                                
> OUTPUT: sphc_all_exercise2.dta
> 
> STATA VERSION: 16.1
> ==============================================================================*/
. clear all

. 
. // See where is my working directory
. pwd 
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Redirect my working directory
. cd "/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data"
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Use the data from exercise 2
. // Or your make_analysis data (if you've already intergrated.)
. clear all

. use sphc_all_exercise2, clear
(Stockholm Public Health Cohort 2002, 2006, 2010)

. 
. /*===============
> =====Part 1======
> ===============*/
. // 1.1 Two by two tables
. // f52a02=living alone
. 
. tab f52a02 sex, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          sex
     alone |    1. man   2. woman |     Total
-----------+----------------------+----------
         0 |    23,810     28,054 |    51,864 
           |     45.91      54.09 |    100.00 
-----------+----------------------+----------
         1 |     7,965     11,274 |    19,239 
           |     41.40      58.60 |    100.00 
-----------+----------------------+----------
     Total |    31,775     39,328 |    71,103 
           |     44.69      55.31 |    100.00 

. 
. // 1.2 Chi-square test 
. tab f52a02 sex, row chi2 exact

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          sex
     alone |    1. man   2. woman |     Total
-----------+----------------------+----------
         0 |    23,810     28,054 |    51,864 
           |     45.91      54.09 |    100.00 
-----------+----------------------+----------
         1 |     7,965     11,274 |    19,239 
           |     41.40      58.60 |    100.00 
-----------+----------------------+----------
     Total |    31,775     39,328 |    71,103 
           |     44.69      55.31 |    100.00 

          Pearson chi2(1) = 115.3891   Pr = 0.000
           Fisher's exact =                 0.000
   1-sided Fisher's exact =                 0.000

. // Interpretation: Sex has association with living alone or not.
. 
. // 1.3 Employment(Exposure) and Living alone(Outcome), stratified by sex_lab 
. bysort sex: tab f52a02 f7502, chi

-------------------------------------------------------------------------------------------------------------
-> sex = 1. man

           |         f7502
     alone |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,230      3,049 |    18,279 
         1 |     5,036      1,256 |     6,292 
-----------+----------------------+----------
     Total |    20,266      4,305 |    24,571 

          Pearson chi2(1) =  34.8796   Pr = 0.000

-------------------------------------------------------------------------------------------------------------
-> sex = 2. woman

           |         f7502
     alone |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,824      4,374 |    23,198 
         1 |     5,994      1,195 |     7,189 
-----------+----------------------+----------
     Total |    24,818      5,569 |    30,387 

          Pearson chi2(1) =  18.2738   Pr = 0.000

-------------------------------------------------------------------------------------------------------------
-> sex = .
no observations


. // Interpretation: Employment has association with living alone or not, in both sex.
. 
. // 1.4 Calculate risk ratio
. // Sex(Exposure) vs. Diabetes(Outcome)
. cs f6a02 female

                 |         female         |
                 |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
           Cases |      1978        2572  |       4550
        Noncases |     49611       39827  |      89438
-----------------+------------------------+-----------
           Total |     51589       42399  |      93988
                 |                        |
            Risk |  .0383415    .0606618  |   .0484104
                 |                        |
                 |      Point estimate    |    [95% Conf. Interval]
                 |------------------------+------------------------
 Risk difference |        -.0223203       |   -.0251325   -.0195081 
      Risk ratio |         .6320535       |    .5969211    .6692536 
 Prev. frac. ex. |         .3679465       |    .3307464    .4030789 
 Prev. frac. pop |         .2019619       |
                 +-------------------------------------------------
                               chi2(1) =   251.68  Pr>chi2 = 0.0000

. 
end of do-file

. tab female

     female |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,196       45.17       45.17
          1 |     52,433       54.83      100.00
------------+-----------------------------------
      Total |     95,629      100.00

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD11296.000000"

. cs f6a02 female

                 |         female         |
                 |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
           Cases |      1978        2572  |       4550
        Noncases |     49611       39827  |      89438
-----------------+------------------------+-----------
           Total |     51589       42399  |      93988
                 |                        |
            Risk |  .0383415    .0606618  |   .0484104
                 |                        |
                 |      Point estimate    |    [95% Conf. Interval]
                 |------------------------+------------------------
 Risk difference |        -.0223203       |   -.0251325   -.0195081 
      Risk ratio |         .6320535       |    .5969211    .6692536 
 Prev. frac. ex. |         .3679465       |    .3307464    .4030789 
 Prev. frac. pop |         .2019619       |
                 +-------------------------------------------------
                               chi2(1) =   251.68  Pr>chi2 = 0.0000

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD11296.000000"

. cs f6a02 female, or

                 |         female         |
                 |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
           Cases |      1978        2572  |       4550
        Noncases |     49611       39827  |      89438
-----------------+------------------------+-----------
           Total |     51589       42399  |      93988
                 |                        |
            Risk |  .0383415    .0606618  |   .0484104
                 |                        |
                 |      Point estimate    |    [95% Conf. Interval]
                 |------------------------+------------------------
 Risk difference |        -.0223203       |   -.0251325   -.0195081 
      Risk ratio |         .6320535       |    .5969211    .6692536 
 Prev. frac. ex. |         .3679465       |    .3307464    .4030789 
 Prev. frac. pop |         .2019619       |
      Odds ratio |         .6173834       |    .5813881    .6556072 (Cornfield)
                 +-------------------------------------------------
                               chi2(1) =   251.68  Pr>chi2 = 0.0000

. 
end of do-file

. doedit

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD11296.000000"

. tab f52a02 sex, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          sex
     alone |    1. man   2. woman |     Total
-----------+----------------------+----------
         0 |    23,810     28,054 |    51,864 
           |     45.91      54.09 |    100.00 
-----------+----------------------+----------
         1 |     7,965     11,274 |    19,239 
           |     41.40      58.60 |    100.00 
-----------+----------------------+----------
     Total |    31,775     39,328 |    71,103 
           |     44.69      55.31 |    100.00 

. 
end of do-file

. exit
