---------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Log/exercise3_20210208.log
  log type:  text
 opened on:   8 Feb 2021, 13:11:29

. 
. /*==============================================================================
> FILENAME: exercise3.do
> 
> PROJECT: Exercise 3, Stockholm Public Health Cohort     
> 
> PURPOSE: Demonstrate exercise3.do to the students
>         
> AUTHOR: Enoch Chen
> 
> CREATED: 20210203 Enoch Chen    
> UPDATED: 20210204 Enoch Chen            
> 
> INPUT DATA: sphc_all.dta                                
> OUTPUT: N/A
> 
> STATA VERSION: 16.1
> ==============================================================================*/
. clear all

. 
. // See where is my working directory
. pwd 
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Redirect my working directory
. cd "$route/Data"
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Use the data from exercise 2
. // Or your make_analysis data (if you've already intergrated.)
. clear all

. use sphc_all_exercise2, clear
(Stockholm Public Health Cohort 2002, 2006, 2010)

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. ==============================================================================*/
== is not a valid command name
r(199);

end of do-file

r(199);

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. clear all

. 
. // See where is my working directory
. pwd 
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Redirect my working directory
. cd "$route/Data"
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Use the data from exercise 2
. // Or your make_analysis data (if you've already intergrated.)
. clear all

. use sphc_all_exercise2, clear
(Stockholm Public Health Cohort 2002, 2006, 2010)

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. tab utb302

     utb302 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     16,659       18.50       18.50
          2 |     37,481       41.62       60.12
          3 |     35,916       39.88      100.00
------------+-----------------------------------
      Total |     90,056      100.00

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. recode utb302 (1=0) (2=1) (3=2), gen(edu)
(90056 differences between utb302 and edu)

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. tab utb302 edu

           |    RECODE of utb302 (utb302)
    utb302 |         0          1          2 |     Total
-----------+---------------------------------+----------
         1 |    16,659          0          0 |    16,659 
         2 |         0     37,481          0 |    37,481 
         3 |         0          0     35,916 |    35,916 
-----------+---------------------------------+----------
     Total |    16,659     37,481     35,916 |    90,056 

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. cs f6a02 edu

                 | RECODE of utb302       |
                 | [utb302]               |
                 |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
           Cases |      2904        1133  |       4037
        Noncases |     69539       15146  |      84685
-----------------+------------------------+-----------
           Total |     72443       16279  |      88722
                 |                        |
            Risk |  .0400867    .0695989  |   .0455017
                 |                        |
                 |      Point estimate    |    [95% Conf. Interval]
                 |------------------------+------------------------
 Risk difference |        -.0295122       |    -.033674   -.0253503 
      Risk ratio |         .5759675       |     .538903    .6155812 
 Prev. frac. ex. |         .4240325       |    .3844188     .461097 
 Prev. frac. pop |         .3462296       |
                 +-------------------------------------------------
                               chi2(1) =   266.56  Pr>chi2 = 0.0000

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. ir f6a02 edu
too few variables specified
r(102);

end of do-file

r(102);

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.utb302

Iteration 0:   log likelihood =  13453.668  

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = u                       [Identity]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      utb302 |
          2  |  -.0205585   .0019565   -10.51   0.000    -.0243932   -.0167239
          3  |  -.0388015   .0019677   -19.72   0.000    -.0426581   -.0349449
             |
       _cons |   .0695989   .0016297    42.71   0.000     .0664048     .072793
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.edu

Iteration 0:   log likelihood =  13453.668  

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = u                       [Identity]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edu |
          1  |  -.0205585   .0019565   -10.51   0.000    -.0243932   -.0167239
          2  |  -.0388015   .0019677   -19.72   0.000    -.0426581   -.0349449
             |
       _cons |   .0695989   .0016297    42.71   0.000     .0664048     .072793
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.edu, nolog

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = u                       [Identity]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edu |
          1  |  -.0205585   .0019565   -10.51   0.000    -.0243932   -.0167239
          2  |  -.0388015   .0019677   -19.72   0.000    -.0426581   -.0349449
             |
       _cons |   .0695989   .0016297    42.71   0.000     .0664048     .072793
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.edu, link(log)

Iteration 0:   log likelihood = -128839.44  
Iteration 1:   log likelihood = -86321.638  (not concave)
Iteration 2:   log likelihood =  11250.396  (not concave)
Iteration 3:   log likelihood =  12892.837  (not concave)
Iteration 4:   log likelihood =  13093.221  (not concave)
Iteration 5:   log likelihood =  13182.187  
Iteration 6:   log likelihood =  13395.295  
Iteration 7:   log likelihood =  13453.307  
Iteration 8:   log likelihood =  13453.668  
Iteration 9:   log likelihood =  13453.668  

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edu |
          1  |  -.3501049    .032181   -10.88   0.000    -.4131785   -.2870313
          2  |  -.8153195   .0427821   -19.06   0.000    -.8991709    -.731468
             |
       _cons |  -2.665007   .0234152  -113.82   0.000      -2.7109   -2.619114
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.edu, eform

Iteration 0:   log likelihood =  13453.668  

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = u                       [Identity]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edu |
          1  |   .9796514   .0019167   -10.51   0.000     .9759019    .9834152
          2  |   .9619416   .0018928   -19.72   0.000     .9582389    .9656586
             |
       _cons |   1.072078   .0017471    42.71   0.000     1.068659    1.075508
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. glm f6a02 i.edu, eform

Iteration 0:   log likelihood =  13453.668  

Generalized linear models                         Number of obs   =     88,722
Optimization     : ML                             Residual df     =     88,719
                                                  Scale parameter =   .0432343
Deviance         =  3835.707404                   (1/df) Deviance =   .0432343
Pearson          =  3835.707404                   (1/df) Pearson  =   .0432343

Variance function: V(u) = 1                       [Gaussian]
Link function    : g(u) = u                       [Identity]

                                                  AIC             =  -.3032093
Log likelihood   =   13453.6684                   BIC             =   -1006963

------------------------------------------------------------------------------
             |                 OIM
       f6a02 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edu |
          1  |   .9796514   .0019167   -10.51   0.000     .9759019    .9834152
          2  |   .9619416   .0018928   -19.72   0.000     .9582389    .9656586
             |
       _cons |   1.072078   .0017471    42.71   0.000     1.068659    1.075508
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. cs f6a02 edu

                 | RECODE of utb302       |
                 | [utb302]               |
                 |   Exposed   Unexposed  |      Total
-----------------+------------------------+-----------
           Cases |      2904        1133  |       4037
        Noncases |     69539       15146  |      84685
-----------------+------------------------+-----------
           Total |     72443       16279  |      88722
                 |                        |
            Risk |  .0400867    .0695989  |   .0455017
                 |                        |
                 |      Point estimate    |    [95% Conf. Interval]
                 |------------------------+------------------------
 Risk difference |        -.0295122       |    -.033674   -.0253503 
      Risk ratio |         .5759675       |     .538903    .6155812 
 Prev. frac. ex. |         .4240325       |    .3844188     .461097 
 Prev. frac. pop |         .3462296       |
                 +-------------------------------------------------
                               chi2(1) =   266.56  Pr>chi2 = 0.0000

. 
end of do-file

. help tabstat

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. clear all

. 
. // See where is my working directory
. pwd 
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Redirect my working directory
. cd "$route/Data"
/Users/yitche/My_Website/content/courses/biostatbasics/excercise/exercise1/Data

. 
. // Use the data from exercise 2
. // Or your make_analysis data (if you've already intergrated.)
. clear all

. use sphc_all_exercise2, clear
(Stockholm Public Health Cohort 2002, 2006, 2010)

. 
end of do-file

. tabstat f6a02 

    variable |      mean
-------------+----------
       f6a02 |  .0484104
------------------------

. return list

. tabstat f6a02, save

    variable |      mean
-------------+----------
       f6a02 |  .0484104
------------------------

. return list

matrices:
          r(StatTotal) :  1 x 1

. gen dia_mean = r(StatTotal)
type mismatch
r(109);

. gen dia_mean = r(StatTotal)[1,1]

. di  dia_mean
.04841043

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. tabstat nsrh , save

    variable |      mean
-------------+----------
        nsrh |  3.877834
------------------------

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. tabstat nsrh , by(agegrp4) save

Summary for variables: nsrh
     by categories of: agegrp4 (agegrp4)

 agegrp4 |      mean
---------+----------
1. 18-29 |   4.04853
2. 30-44 |  4.014061
3. 45-64 |  3.841749
4. 65-84 |  3.623279
---------+----------
   Total |  3.877834
--------------------

. 
end of do-file

. return li

macros:
              r(name4) : "4. 65-84"
              r(name3) : "3. 45-64"
              r(name2) : "2. 30-44"
              r(name1) : "1. 18-29"

matrices:
              r(Stat4) :  1 x 1
              r(Stat3) :  1 x 1
              r(Stat2) :  1 x 1
              r(Stat1) :  1 x 1
          r(StatTotal) :  1 x 1

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. gen stat3 =   r(Stat3)[1,1]

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. dis stat3
3.841749

. 
end of do-file

. do "/var/folders/_9/lhjg660s4psdlb1xk2tj7c0x96f25w/T//SD04994.000000"

. local todaydate: di %tdCYND date(c(current_date),"DMY")

. capture log close
